#Область ОбработчикиСобытийФормы

//В задани написанно:
//Примечание: не забудьте, что изменения формы реализуются программно, новые объекты и методы добавляются с префиксом.
//Но на созданные формы это же не распростроняется? Даже если 1с создаст форму для элемента, 
//то врятли она хоть как-то будет стыковаться с созданной нами 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ВидимостьДополнительныхЭлементов();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьДополнительныхЭлементов();
	
КонецПроцедуры 

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВидимостьДополнительныхЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидимостьДополнительныхЭлементов()
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_Абонент") Тогда
		Элементы.ПериодДействия.Видимость = Истина;
		Элементы.ВКМ_АбонентскаяПлата.Видимость = Истина;
		Элементы.ВКМ_СтавкаЧаса.Видимость = Истина;
	Иначе
		Элементы.ПериодДействия.Видимость = Ложь;
		Элементы.ВКМ_АбонентскаяПлата.Видимость = Ложь;
		Элементы.ВКМ_СтавкаЧаса.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти