
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВКМ_ГрафикРаботы") Тогда
		Объект.ВКМ_ГрафикРаботы = Параметры.ВКМ_ГрафикРаботы;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВКМ_ЗаполнитьГрафик(Команда)
	
	ВыполнитьОбработку();
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Заполнение графика завершено'"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьОбработку()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВКМ_ЗаполнитьГрафик(ВКМ_Период.ДатаНачала, ВКМ_Период.ДатаОкончания, ВКМ_Выходные);
КонецПроцедуры

#КонецОбласти