
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.Дата = КонецМесяца(Объект.Дата);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВКМ_Заполнить(Команда)
	ВКМ_ЗаполнитьНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВКМ_ЗаполнитьНаСервере()
	
	Объект.Дата = ТекущаяДатаСеанса();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_Сотрудник КАК Сотрудник,
	|	СУММА(ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_СуммаОстаток) КАК СуммаОстаток,
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_ВидРасчета КАК ВидРасчета
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период,) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_Сотрудник,
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_ВидРасчета";
	
	Период = Новый Граница(Объект.Дата, ВидГраницы.Включая);
	Запрос.УстановитьПараметр("Период", Период);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Объект.ВКМ_Выплаты.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		Строка = Объект.ВКМ_Выплаты.Добавить();
		Строка.ВКМ_Сотрудник = Выборка.Сотрудник;
		Строка.ВКМ_ВидРасчета = Выборка.ВидРасчета;
		Строка.ВКМ_Сумма = Выборка.СуммаОстаток;
		
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти